[PIH, FLWS
{"Article": 1},
{"name": "FCCY"},
{"Article": 1},
{"name": "SRCE"},
{"Article": 1},
{"name": "VNET"},
{"name": "XXII"},
{"Article": 1},
{"paragraph": "<p>CLARENCE, N.Y. (AP) _ 22nd Century Group Inc. (XXII) on Wednesday reported a loss of $2.7 million in its fourth quarter.</p>"},
{"paragraph": "<p>On a per-share basis, the Clarence, New York-based company said it had a loss of 3 cents.</p>"},
{"paragraph": "<p>The plant biotechnology company posted revenue of $3.3 million in the period.</p>"},
{"paragraph": "<p>For the year, the company reported that its loss widened to $11.6 million, or 15 cents per share. Revenue was reported as $12.3 million.</p>"},
{"paragraph": "<p>In the final minutes of trading on Wednesday, the company's shares hit 92 cents. A year ago, they were trading at 90 cents.</p>"},
{"paragraph": "<p>This story was generated by Automated Insights (<a href=\"http://automatedinsights.com/ap\">http://automatedinsights.com/ap</a>) using data from Zacks Investment Research. Access a Zacks stock report on XXII at <a href=\"https://www.zacks.com/ap/XXII\">https://www.zacks.com/ap/XXII</a></p>"},
{"paragraph": "<p>Keywords: 22nd Century Group, Earnings Report</p>"},
{"name": "TWOU"},
{"Article": 1},
{"paragraph": "<p>  Once the Dow Jones industrial average hits 20,000, don't expect momentum to power it even higher, market strategist Paul Schatz told CNBC on Thursday. <br> </p>"},
{"paragraph": "<p>  In fact, it's \"a rally you can sell,\" the president of Heritage Capital said in an interview with \"<a href=\"/closing-bell/\" target=\"_blank\">Closing Bell</a>.\" </p>"},
{"paragraph": "<p>  <a href=\"/2017/01/12/us-markets.html\" target=\"_blank\">Stocks ended lower on Thursday</a>, with the <a class=\"inline_quotes\" data-gdsid=\"599362\" data-inline-quote-symbol=\".DJI\" href=\"http://data.cnbc.com/quotes/.DJI\" target=\"_blank\">Dow Jones industrial average</a> down about 63 points at 19,891. </p>"},
{"paragraph": "<p>  The market has rallied since President-elect <a href=\"/donald-trump/\" target=\"_blank\">Donald Trump</a>'s victory in November, with investors pinning their hopes on tax cuts, less regulation and a pro-growth environment.  </p>"},
{"paragraph": "<p>  However, it has been going sideways for a month, Schatz pointed out.  </p>"},
{"paragraph": "<p>  \"That shows we've got underlying strength,\" he said. \"The rally's been on less stocks participating the last couple of weeks. We need a little bit more consolidation, digestion, maybe into halfway through earnings season.\" </p>"},
{"paragraph": "<p>  He's confident that if Trump \"stops tweeting\" and let's Congress take over, a substantial conversation will occur.  </p>"},
{"paragraph": "<p>  \"Then we can hit 21,000, maybe early second quarter,\" Schatz predicted.   </p>"},
{"paragraph": "<p>  Sandy Villere, co-portfolio manager of the Villere Balanced Fund at Villere &amp; Co., sees buying opportunities when the market goes down.  </p>"},
{"paragraph": "<p>  \"It's going to be a great, pro-growth environment and probably will lead to higher interest rates, which could lead to a stronger dollar,\" he told \"Closing Bell.\" </p>"},
{"paragraph": "<p>  \"I want to focus on the companies that I buy which are smaller and mid-cap companies. So that's what I'm doing — buying on the dips,\" he added.  </p>"},
{"paragraph": "<p>  Villere specifically likes <a class=\"inline_quotes\" data-gdsid=\"148586\" data-inline-quote-symbol=\"TWOU\" href=\"http://data.cnbc.com/quotes/TWOU\" target=\"_blank\">2U</a>, a \"disruptive online education company\" and <a class=\"inline_quotes\" data-gdsid=\"33801\" data-inline-quote-symbol=\"TASR\" href=\"http://data.cnbc.com/quotes/TASR\" target=\"_blank\">Taser</a>, which he thinks is going to do quite well with its body camera business. </p>"},
{"paragraph": "<p>  Stephanie Link, managing director and active equities portfolio manager at TIAA Global Asset Management, took advantage of the down day to buy some financials, like <a class=\"inline_quotes\" data-gdsid=\"10548\" data-inline-quote-symbol=\"AXP\" href